{
  "basics": {
    "name": "Maxwell Barlow",
    "label": "Programmer Analyst",
    "image": "",
    "email": "barlowm15@gmail.com",
    "phone": "(978) 501-6331",
    "url": "",
    "summary": "Software Engineer, Research Assistant, and aspiring Scientist.",
    "location": {
      "address": "11 Gore Rd.",
      "postalCode": "MA 01570",
      "city": "Webster",
      "countryCode": "US",
      "region": "Massachusetts"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "maxb00",
        "url": "https://linkedin.com/in/maxb00"
      }
    ]
  },
  "work": [
    {
      "name": "MAPFRE Insurance",
      "position": "Programmer/Analyst I",
      "url": "https://www.mapfreinsurance.com/",
      "startDate": "2023-06-05",
      "endDate": "Now",
      "summary": "TODO",
      "highlights": [
        "Guidewire",
        "Java", "SQL",
        "Design Lifecycle",
        "Production Support"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "People's Climate March",
      "position": "Lead Organizer",
      "url": "https://example.com",
      "startDate": "2014-04-01",
      "endDate": "2015-07-01",
      "summary": "Lead organizer for the New York City branch of the People's Climate March, the largest climate march in history.",
      "highlights": [
        "Awarded 'Climate Hero' award by Greenpeace for my efforts organizing the march.","Men of the year 2014 by Time magazine"
      ]
    }],
  "education": [
    {
      "institution": "Florida Southern College",
      "location": "Lakeland, Florida",
      "url": "https://www.flsouthern.edu/",
      "area": "Computer Science: Machine Learning and Artifical Intelligence",
      "studyType": "Bachelor of Science",
      "startDate": "2019",
      "endDate": "2023",
      "score": "3.79",
      "courses": [
        "Advanced Topics in Artifical Intelligence",
        "Calculus III - Plane Analytic Geometry",
        "Critical Theories of Race",
        "Philosophy & Artifical Intelligence",
        "Advanced Programming Techniques"
      ]
    }
  ],
  "awards": [
    {
      "title": "McClurg Scholarship",
      "date": "2019-08-15",
      "awarder": "Florida Southern College",
      "url": "https://www.flsouthern.edu/admissions/undergraduate/undergraduate-financial-aid/undergraduate-scholarships/prestige-scholarships",
      "summary": "Full tuition and fees to attend Florida Southern College from Fall 2019 through Spring 2023."
    }
  ],
  "certificates": [
    {
      "name": "Guidewire Associate Developer",
      "date": "2023-10-01",
      "issuer": "Guidewire Software",
      "url": "https://www.guidewire.com/",
      "icon": "fa-solid fa-code"
    }
  ],
  "publications": [
    {
      "name": "MOCSIDE: An Open-Source and Scalable Online IDE and Auto-Grader for Computer Science Education",
      "publisher": "Association for Computing Machinery",
      "releaseDate": "2022-03-04",
      "url": "https://doi.org/10.1145/3478432.3499125",
      "summary": "Programming is learned through practice, with said practice in introductory programming courses often translating to a prohibitively large number of assignments, increasing the grading workload for faculty and/or teaching assistants. In short, this is unsustainable. Several publishers and a few notable companies have provided meritable auto-grading solutions, although most are plagued with problems including minimal problem sets, limited customization options, high cost, and at times even a disconnect with the pedagogical needs of academia. This poster presents our newly-developed web application, MOCSIDE, an open-source and scalable online IDE and auto-grader for computer science education. Results indicate a positive user experience from students and instructors alike, with cost savings, ease of use, and code collaboration highlighted as key features."
    },
    {
      "name": "Going with the Flow: An AI Approach to Solving the Puzzle Game FlowFree",
      "publisher": "Florida Undergraduate Research Association",
      "releaseDate": "2023-02-15",
      "url": "",
      "summary": "Can we solve FlowFree? FlowFree, also known as Zig-Zag Numberlink, is a popular puzzle game where the player connects ‘flows’ on a board with the goal of finishing each connection, avoiding intersecting flows, and filling up the entire game board. We employed two methods for solving puzzles: A* search and boolean satisfiability (SAT). A* searched through a tree of board states, choosing between states one cell apart based on a heuristic that considered distance to a completed flow. The search tree was pruned with the help of several constraints of varying complexity to check for. Constraint extrapolation further allowed the framing of FlowFree as a constraint satisfaction problem (CSP), which allowed the solving of boards as SAT problems. Solving as a CSP involves the conversion of puzzles into SAT variables, indicating the truth value of possible flow directions and color at each individual cell, arranged into conjunctive normal form clauses representing the constraints, feeding to a SAT solver and subsequently decoded from a set of true variables to a solved puzzle. SAT showed significant speed improvement over A*, with the difference being more pronounced in larger puzzle sizes. Puzzles were collected from the FlowFree mobile app and converted using computer vision to text files; A GUI application was also created to allow inputting custom puzzles as well as partially solving a puzzle before solve time."
    },
    {
      "name": "MOCSIDE: An Open-Source and Scalable Online IDE and Auto-Grader for Introductory Programming Courses",
      "publisher": "Consortium for Computing Sciences in Colleges",
      "releaseDate": "2021-10-15",
      "url": "https://doi.org/10.5555/3512733.3512734",
      "summary": "Programming is learned through practice, with said practice in introductory programming courses often translating to a prohibitively large number of assignments, increasing the grading workload for faculty and/or teaching assistants. In short, this is unsustainable. Several publishers and a few notable companies have provided meritable solutions, although most are plagued with problems including minimal problem sets, limited customization options, high cost, and even a disconnect with the pedagogical needs within academia. This paper presents a survey of the more popular solutions currently available, followed by a presentation of our newly-developed web application, MOCSIDE: open-source and scalable online IDE and auto-grader for computer science education."
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "Profficient",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python","Java","Gosu", "PHP","TypeScript","C++", "Docker",
        "Laravel", "Vue", "Django", "React"
      ]
    },
    {
      "name": "Data Science",
      "level": "Intermediate",
      "icon": "fa-solid fa-box-archive",
      "keywords": [
        "Tensorflow", "Numpy", "Pyplot", "Pytorch", "HuggingFace",
        "Pandas", "Gensim", "Jupyter", "MySQL", "MongoDB"
      ]
    },
    {
      "name": "Other Technologies",
      "icon": "fa-solid fa-laptop-code",
      "keywords": [
        "Linux", "bash", "git", "Microsoft Office Suite"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon":""
    }
  ],
  "interests": [
    {
      "name": "Natural Language Processing",
      "icon": "fa-solid fa-language",
      "keywords": [
        "Transformers","Transfer Learning","Bag-of-Words","Recurrent NNs", "Human-AI Interaction", "Ethics", "Theory of Mind"
      ]
    },
    {
      "name": "Explainable AI",
      "icon": "fa-solid fa-satellite-dish",
      "keywords": [
        "Decision Landscapes", "Chain-of-thought", "Education and Outreach"
      ]
    },
    {
      "name": "Global Equality",
      "icon": "fa-solid fa-transgender",
      "keywords": [
        "Critical Race Theory", "LGBTQ+ Issues", "Climate Change", "Anti-TESCREALism"
      ]
    }
  ],
  "references": [
    {
      "name": "Jens Kipper, PhD",
      "icon": "fa-solid fa-book",
      "reference": "519 Lattimore Hall, Rochester, NY. (585) 275-4105. jens.kipper@rochester.edu"
    },
    {
      "name": "Jonathan Cazalas, PhD",
      "icon": "fa-solid fa-thumbtack",
      "reference": "Weinstein Computer Science Center - 117, Lakeland, FL. (863) 680-6283. jcazalas@flsouthern.edu"
    }
  ],
  "projects": [
    {
      "name": "Machine Learning and Conceptual Analysis",
      "summary": "Under direction from Jens Kipper, completed a summer research assitanstship as part of the Music, Media, and Minds REU at the University of Rochester. Applied novel techniques in Natural Language Processing for interdisciplinary investigation with the Philosophy of Language. Presented our work on several occasion, and are currently pursuing publication with results from the project.",
      "highlights": [
        "Natural Language Processing",
        "Philosophy of Language",
        "Word Embeddings",
        "Transformers",
        "Undergraduate Research"
      ],
      "startDate": "2022-5-23",
      "endDate": "2022-08-15"
    },
    {
      "name": "MocsIDE",
      "summary": "Over the course of 2021, created a fully functional computer science homework online IDE and auto-grader in an attempt to replace premium options. Created in a team of three with no prior web development experience, a semester was spent planning and learning which lead to a summer of rapid development. In the following semester we polished the project and submitted our work for publication in academic journals. Accepted for publication through CCSC SE, and presented as a poster at SIGCSE 2022.",
      "highlights": [
        "API design",
        "Docker", "Linux",
        "Python", "PHP",
        "SIGCSE 2022"
      ],
      "startDate": "2021-01-05",
      "endDate": "2022-2-15",
      "url": "https://mocside.com"
    },
    {
      "name": "Orthopedic Appointment Location Search",
      "summary": "Created a lightweight web application for an orthopedic surgeon to aid office workers in choosing an efficient appointment location for patients who could see a variety of doctors in Ohio and the surrounding states.",
      "startDate": "2022-01-01",
      "endDate": "2022-5-01",
      "highlights": [
        "Progressive Web Applications",
        "NoSQL", "Cloud Computing",
        "Google Firebase",
        "Community Focused Design"
      ]
    },
    {
      "name": "SCUDEM VI",
      "summary": "Participated in SIMIODE's SCUDEM VI challenge. In a team of three coached by Jason Elsinger, created a unique system of equations to model different behaviors of hair-stealing birds to simulate how certain behaviors affect population over time. Recived an outstanding team award for our work and presentation, which is now hosted on the SIMIODE youtube channel.",
      "startDate": "2021-9-15",
      "endDate": "2021-12-15",
      "highlights": [
        "Differential Equations",
        "Population Modeling",
        "Evolutionary Algorithms",
        "Outstanding Team award"
      ],
      "url": "https://www.youtube.com/watch?v=h7ip31xjsvA"
    },
    {
      "name": "FlowFree AI Solver",
      "summary": "My capstone project as a computer science student, advised by Matthew Eicholtz and presented at FURC 2023. Set out to solve a popular puzzle game called FlowFree (Zig-Zag Numberlink) using AI techniques. First applied A* search with a novel heuristic to solve puzzles, then implemented a SAT reduction to solve larger puzzles with efficiency. Presented to a mostly non-technical audience, requiring pedagogial considerations in presenting math-heavy content in an interpretable fashion.",
      "startDate": "2022-08-15",
      "endDate": "2023-03-15",
      "highlights": [
        "Heuristic Search",
        "Greedy Algorithms",
        "Boolean Satisfiability",
        "Graph Reduction",
        "Design Lifecycle",
        "Non-technical presentation"
      ]
    },
    {
      "name": "Signaling Games",
      "summary": "After sending out *Conceptual Complexity, Conceptual Analysis, and Machine Learning*, lab work with Jens Kipper shifted to modeling Signaling Games like the ones proposed by philosopher David K. Lewis. Currently ongoing, with my contribution on hiatus pending my professional schedule.",
      "startDate": "2023-02-01",
      "endDate": "2023-06-05",
      "highlights": [
        "Jupyter Notebooks",
        "Philosophy of Language",
        "Reinforcement Learning"
      ]
    }
  ]
}
